// 101 政治题目
const questions = [
    {
        score: 1,
        text: ["习近平新时代中国特色社会主义思想是推进理论创新的光辉典范。新时代谱写马克思主义中国化时代化新篇章，要坚守理论创新的基础和前提，坚守好理论创新“魂”和“根”。", "中国化时代化的马克思主义的“魂脉”和“根脉”是"],
        choice: ["马克思主义和中华优秀传统文化", "共产主义社会理想和“天下大同”理想", "全人类共同价值和社会主义核心价值观", "共产主义远大理想和中国特色社会主义共同理想"],
        correct: [true, false, false, false],
    }, {
        score: 1,
        text: ["一个地方的气候主要取决于纬度、海陆位置、地形，以及大气环流和洋流等因素。纬度、海陆位置、地形等因素在一定时期内基本保持不变，大气环流与洋流二者相互作用就形成相对稳定的气候状态，但当其中一个因素突然“掉链子”，就会发生厄尔尼诺之类的异常现象。厄尔尼诺现象不仅推高全球变暖幅度，更可能导致频次更多、范围更广、强度更大的极端天气，进而影响全球气候。", "厄尔尼诺现象对全球气候的影响表明，偶然因素是"],
        choice: ["决定事物发展趋势的根本性因素", "事物发展中可有可无的影响因素", "事物发展中不可忽视的影响因素", "事物发展过程中确定不移的因素"],
        correct: [false, false, true, false],
    }, {
        score: 1,
        text: ["除了几十颗卫星编织的“天上一张网”，还有地基增强系统构成的“地上一张网”, 北斗卫星导航系统开启了高精度定位技术进步的“加速度”。有了“天上一张网”, 为什么还要再建“地上一张网”？传统的卫星导航系统能提供的精度仅为5~10米，而北斗卫星导航系统可以实现提供实时米级、分米级、厘米级的更高精度的定位服务。从农林牧渔到吃穿住行，随着北斗卫星导航芯片或模块越来越多嵌入生产生活， 每一个人都愈发清晰地感知到北斗的力量。", "北斗卫星导航系统在发展中应用、在应用中发展表明，技术进步的根本动力是"],
        choice: ["马克思主义和中华优秀传统文化", "共产主义社会理想和“天下大同”理想", "全人类共同价值和社会主义核心价值观", "共产主义远大理想和中国特色社会主义共同理想"],
        correct: [false, false, false, true],
    }, {
        score: 1,
        text: ["列宁在谈到未来社会时写道。“生产力将以什么样的速度向前发展，将以什么样的速度发展到打破分工、消灭脑力劳动和体力劳动的对立、把劳动变为‘生活的第一需要’，这都是我们所不知道而且也不可能知道的”，“我们只能谈国家消亡的必然性，同时着重指出这个过程是长期的，指出它的长短将取决于共产主义高级阶段的发展速度，而把消灭的日期或消亡的具体形式作为悬案，因为现在还没有可供解决这些问题的材料”。", "这表明，列宁在展望未来社会时"],
        choice: ["揭示了社会历史发展的各项措施、方式、方法", "认为不存在适用于各种社会形态发展的普遍规律", "没有提出未来社会发展的方向、原则和基本特征", "不对历史发展的各种细节作具体描绘"],
        correct: [false, false, false, true],
    }, {
        score: 1,
        text: ["随着我国生产资料私有制社会主义改造的基本完成，国内的社会矛盾和阶级关系发生重大变化。", "在此背景下，毛泽东在1957年2月作《关于正确处理人民内部矛盾的问题》的报告，明确提出把正确处理人民内部矛盾作为我国政治生活的主题，其根本着眼点是"],
        choice: ["调动一切积极因素为社会主义建设服务", "扩大社会主义民主，健全社会主义法制", "维护社会稳定，实现长治久安", "消除社会矛盾，实现民族大团结"],
        correct: [true, false, false, false],
    }
];
